## 3.1 数据的引用

### 3.1.1 引用数据的方法

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

3.1 DataFrame 对象的创建

In [2]:
val = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(val, index=[0,2,4], columns=list('def'))
df

   d  e  f
0  1  2  3
2  4  5  6
4  7  8  9

3.2 DataFrame 对象的索引标签和行的位置索引

In [3]:
print(df.loc[2])
print(df.iloc[2])

d    4
e    5
f    6
Name: 2, dtype: int64
d    7
e    8
f    9
Name: 4, dtype: int64

3.3 Series 对象的索引标签和位置索引

In [4]:
ser = pd.Series([1,2,3], index=[0,2,4])
ser

0    1
2    2
4    3
dtype: int64

In [5]:
print(ser.loc[2])
print(ser.iloc[2])

2
3

3.4 DataFrame 对象的创建

In [6]:
val = np.arange(1,10).reshape(3,3)
df = pd.DataFrame(val, index=[0,2,4], columns=list('def'))
df

   d  e  f
0  1  2  3
2  4  5  6
4  7  8  9

3.5 使用方括号（[ ]）选择列

In [7]:
df['e']

0    2
2    5
4    8
Name: e, dtype: int32

In [8]:
df[['e','d']]

   e  d
0  2  1
2  5  4
4  8  7

3.6 指定整数的列标签选择列

In [9]:
df2 = pd.DataFrame(val, index=[0,5,10], columns=[0,2,4])
df2

    0  2  4
0   1  2  3
5   4  5  6
10  7  8  9

In [10]:
df2[2]

0     2
5     5
10    8
Name: 2, dtype: int32

3.7 使用方括号（[ ]）和切片选择行

In [11]:
df2[0:2]

   0  2  4
0  1  2  3
5  4  5  6

3.8 使用 bool 类型数组选择行

In [12]:
df[[True,False,True]]

   d  e  f
0  1  2  3
4  7  8  9

### 3.1.2 切片

3.9 DataFrame 对象的创建

In [13]:
val = np.arange(0,25).reshape(5,5)
df = pd.DataFrame(val, index=[10,5,2,12,6], columns=list('abcde'))
df

     a   b   c   d   e
10   0   1   2   3   4
5    5   6   7   8   9
2   10  11  12  13  14
12  15  16  17  18  19
6   20  21  22  23  24

3.10 方括号（[ ]）和切片

In [14]:
df[2:4]

     a   b   c   d   e
2   10  11  12  13  14
12  15  16  17  18  19

3.11 切片和公差

In [15]:
df[0:5:2]

     a   b   c   d   e
10   0   1   2   3   4
2   10  11  12  13  14
6   20  21  22  23  24

3.12 在公差中指定 –1，以相反的顺序选择数据

In [16]:
df[::-1]

     a   b   c   d   e
6   20  21  22  23  24
12  15  16  17  18  19
2   10  11  12  13  14
5    5   6   7   8   9
10   0   1   2   3   4

3.13 loc 属性和切片

In [17]:
df.loc[2:6]

     a   b   c   d   e
2   10  11  12  13  14
12  15  16  17  18  19
6   20  21  22  23  24

3.14 loc 属性和切片

In [18]:
df.loc[:, 'b':'e']

     b   c   d   e
10   1   2   3   4
5    6   7   8   9
2   11  12  13  14
12  16  17  18  19
6   21  22  23  24

3.15 iloc 属性和切片

In [19]:
df.iloc[2:4]

     a   b   c   d   e
2   10  11  12  13  14
12  15  16  17  18  19

3.16 iloc 属性和切片

In [20]:
df.iloc[:, 1:4]

     b   c   d
10   1   2   3
5    6   7   8
2   11  12  13
12  16  17  18
6   21  22  23

### 3.1.3 属性的引用

3.17 使用 Series 对象的属性引用数据

In [21]:
ser = pd.Series([1,2,3], index=list('abc'))
ser.a

1

3.18 使用 DataFrame 对象的属性引用数据

In [22]:
df = pd.DataFrame([[1,2,3],[4,5,6]], columns=list('abc'))
df.c

0    3
1    6
Name: c, dtype: int64

In [23]:
df = pd.DataFrame([[1,2,3],[4,5,6]], columns=[1,2,3])
# 不是python的有效标识
# df.1

# SyntaxError: invalid syntax

3.20 标签名与类方法名重复

In [24]:
df = pd.DataFrame([[1,2,3],[4,5,6]], columns=['height','weight','min'])
df.height

0    1
1    4
Name: height, dtype: int64

In [25]:
df.min

<bound method DataFrame.min of    height  weight  min
0       1       2    3
1       4       5    6>

3.21 使用方括号（[ ]）和 loc 属性引用数据

In [26]:
df.loc[:,'min']

0    3
1    6
Name: min, dtype: int64

3.1.4 bool类型的引用

3.22 使用 bool 类型数组选择行

In [27]:
df = pd.DataFrame([[1,2],[3,4],[5,6]])
df[[True,False,True]]

   0  1
0  1  2
2  5  6

3.23 NumPy 的 randint 函数

In [28]:
np.random.seed(seed=1)
val = np.random.randint(0,10,size=25).reshape(5,5)
val

array([[5, 8, 9, 5, 0],
       [0, 1, 7, 6, 9],
       [2, 4, 5, 2, 4],
       [2, 4, 7, 7, 9],
       [1, 7, 0, 6, 9]])

3.24 创建包含整数类型随机数的 DataFrame 对象

In [29]:
df = pd.DataFrame(val, columns=list('abcde'))
df

   a  b  c  d  e
0  5  8  9  5  0
1  0  1  7  6  9
2  2  4  5  2  4
3  2  4  7  7  9
4  1  7  0  6  9

3.25 基于条件表达式生成包含 bool 类型值的 Series 对象

In [30]:
df['a'] > 3

0     True
1    False
2    False
3    False
4    False
Name: a, dtype: bool

3.26 基于条件表达式的引用

In [31]:
df[df['a'] > 3]

   a  b  c  d  e
0  5  8  9  5  0

3.27 使用运算符“&”对多个条件表达式进行引用

In [32]:
df[(df['a'] > 1) & (df['b'] == 4)]

   a  b  c  d  e
2  2  4  5  2  4
3  2  4  7  7  9

3.28 使用运算符“|”对多个条件表达式进行引用

In [33]:
df[(df['a'] > 1) | (df['b'] == 4)]

   a  b  c  d  e
0  5  8  9  5  0
2  2  4  5  2  4
3  2  4  7  7  9

3.29 使用运算符“～”对多个条件表达式进行引用

In [34]:
df[~(df['a'] > 1)]

   a  b  c  d  e
1  0  1  7  6  9
4  1  7  0  6  9

### 3.1.5 where方法

3.30 Series 对象的方括号（[ ]）引用与 where 方法引用的比较

In [35]:
ser = pd.Series([1,2,3,4,5])
ser[ser > 3]

3    4
4    5
dtype: int64

In [36]:
ser.where(ser > 3)

0    NaN
1    NaN
2    NaN
3    4.0
4    5.0
dtype: float64

3.31 DataFrame 对象的创建

In [37]:
np.random.seed(seed=1)
val = np.random.randint(0,10,size=25,).reshape(5,5)
df = pd.DataFrame(val, columns=list('abcde'))
df

   a  b  c  d  e
0  5  8  9  5  0
1  0  1  7  6  9
2  2  4  5  2  4
3  2  4  7  7  9
4  1  7  0  6  9

3.32 DataFrame 对象的方括号（[ ]）引用与 where 方法引用的比较

In [38]:
df[df > 3]

     a    b    c    d    e
0  5.0  8.0  9.0  5.0  NaN
1  NaN  NaN  7.0  6.0  9.0
2  NaN  4.0  5.0  NaN  4.0
3  NaN  4.0  7.0  7.0  9.0
4  NaN  7.0  NaN  6.0  9.0

In [39]:
df.where(df > 3)

     a    b    c    d    e
0  5.0  8.0  9.0  5.0  NaN
1  NaN  NaN  7.0  6.0  9.0
2  NaN  4.0  5.0  NaN  4.0
3  NaN  4.0  7.0  7.0  9.0
4  NaN  7.0  NaN  6.0  9.0

3.33 where 方法的 other 参数

In [40]:
df = df.where(~(df == 0), other=-1)
df

   a  b  c  d  e
0  5  8  9  5 -1
1 -1  1  7  6  9
2  2  4  5  2  4
3  2  4  7  7  9
4  1  7 -1  6  9

3.34 使用 bool 类型数组变更 DataFrame 对象的值

In [41]:
df[df == -1] = 0
df

   a  b  c  d  e
0  5  8  9  5  0
1  0  1  7  6  9
2  2  4  5  2  4
3  2  4  7  7  9
4  1  7  0  6  9

3.35 DataFrame 对象的 mask 方法

In [42]:
df.mask(df < 5)

     a    b    c    d    e
0  5.0  8.0  9.0  5.0  NaN
1  NaN  NaN  7.0  6.0  9.0
2  NaN  NaN  5.0  NaN  NaN
3  NaN  NaN  7.0  7.0  9.0
4  NaN  7.0  NaN  6.0  9.0

### query方法

3.36 DataFrame 对象的创建

In [43]:
df = pd.DataFrame([[1,2,3],[4,5,6]], index=[2,4], columns=list('cde'))
df

   c  d  e
2  1  2  3
4  4  5  6

3.37 DataFrame 对象的 query 方法

In [44]:
df.query('index > c')

   c  d  e
2  1  2  3

3.38 query 方法与索引的 name 属性

In [45]:
df.index.name = 'index_name'
df.query('index_name > c')

            c  d  e
index_name
2           1  2  3

3.39 DataFrame 对象的创建

In [46]:
scores = [[76,86,90],[91,78,80],[88,76,76]]
names = ['A','B','C']
subjects = ['数学','英语','物理']
df = pd.DataFrame(scores, index=subjects, columns=names)
df

     A   B   C
数学  76  86  90
英语  91  78  80
物理  88  76  76

3.40 使用 query 方法和条件表达式进行引用

In [47]:
df.query('A > B')

     A   B   C
英语  91  78  80
物理  88  76  76

3.41 使用条件表达式和方括号（[ ]）进行引用

In [48]:
df[df['A'] > df['B']]

     A   B   C
英语  91  78  80
物理  88  76  76

3.42 query 方法与运算符“&”

In [49]:
df.query('(A > B) & (A > C)')

     A   B   C
英语  91  78  80
物理  88  76  76

3.43 使用条件表达式和方括号（[ ]）进行引用

In [50]:
df[(df['A'] > df['B']) & (df['A'] > df['C'])]

     A   B   C
英语  91  78  80
物理  88  76  76

3.44 使用多个条件表达式进行引用

In [51]:
df.query('A > C > B')

     A   B   C
英语  91  78  80

In [52]:
df.query('(A > C) & (C > B)')

     A   B   C
英语  91  78  80

3.45 使用多个值进行数据引用

In [53]:
df.query('A == [76, 91]')

     A   B   C
数学  76  86  90
英语  91  78  80

3.46 read_csv 函数

## 3.2 文件的读取与写入

### 3.2.1 CSV

In [54]:
df = pd.read_csv('./data/ex1.csv')
df

    a   b   c   d   e
0  37  12  72   9  75
1   5  79  64  16   1
2  76  71   6  25  50
3  20  18  84  11  28
4  29  14  50  68  87

3.47 read_csv 函数和 header 参数（整数）

In [55]:
pd.read_csv('./data/ex1.csv', header=2)

    5  79  64  16   1
0  76  71   6  25  50
1  20  18  84  11  28
2  29  14  50  68  87

3.48 read_csv 函数和 header 参数（None）

In [56]:
pd.read_csv('./data/ex1.csv', header=None)

    0   1   2   3   4
0   a   b   c   d   e
1  37  12  72   9  75
2   5  79  64  16   1
3  76  71   6  25  50
4  20  18  84  11  28
5  29  14  50  68  87

3.49 read_csv 函数和 names 参数

In [57]:
pd.read_csv('./data/ex1.csv', header=None, names=list('fnmdp'))

    f   n   m   d   p
0   a   b   c   d   e
1  37  12  72   9  75
2   5  79  64  16   1
3  76  71   6  25  50
4  20  18  84  11  28
5  29  14  50  68  87

3.50 read_csv 函数和 index_col 参数（列标签）

In [58]:
pd.read_csv('./data/ex2.csv', index_col='name')

      height  weight     sex   stay
name
a        161      54  Female   True
b        180      87    Male  False
c        159      49  Female    Yes
d        178      73    Male     No
e        167      67    Male     No

3.51 read_csv 函数和 index_col 参数（位置索引）

In [59]:
pd.read_csv('./data/ex2.csv', index_col=3)

       name  height  weight   stay
sex
Female    a     161      54   True
Male      b     180      87  False
Female    c     159      49    Yes
Male      d     178      73     No
Male      e     167      67     No

3.52 read_csv 函数和 index_col 参数（多个标签）

In [60]:
pd.read_csv('./data/ex2.csv', index_col=['name','sex'])

             height  weight   stay
name sex
a    Female     161      54   True
b    Male       180      87  False
c    Female     159      49    Yes
d    Male       178      73     No
e    Male       167      67     No

3.53 read_csv 函数和 usecols 参数

In [61]:
pd.read_csv('./data/ex2.csv', usecols=['name','weight'])

  name  weight
0    a      54
1    b      87
2    c      49
3    d      73
4    e      67

3.54 read_csv 函数和 squeeze 参数

In [62]:
# 当前版本没有这个参数
# pd.read_csv('./data/ex2.csv', usecols=['weight'], squeeze=True)

3.55 read_csv 函数和 skiprows 参数

In [63]:
pd.read_csv('./data/ex2.csv', header=None, skiprows=2)

   0    1   2       3      4
0  b  180  87    Male  False
1  c  159  49  Female    Yes
2  d  178  73    Male     No
3  e  167  67    Male     No

3.56 read_csv 函数和 skiprows 参数（多个）

In [64]:
pd.read_csv('./data/ex2.csv', skiprows=[1,3,5])

  name  height  weight   sex   stay
0    b     180      87  Male  False
1    d     178      73  Male     No

3.57 read_csv 函数和 skipfooter 参数

In [65]:
pd.read_csv('./data/ex2.csv', skipfooter=1, engine='python')

  name  height  weight     sex   stay
0    a     161      54  Female   True
1    b     180      87    Male  False
2    c     159      49  Female    Yes
3    d     178      73    Male     No

3.58 read_csv 函数和 nrows 参数

In [66]:
pd.read_csv('./data/ex2.csv', nrows=3)

  name  height  weight     sex   stay
0    a     161      54  Female   True
1    b     180      87    Male  False
2    c     159      49  Female    Yes

3.59 read_csv 函数和 dtype 参数（object）

In [67]:
df = pd.read_csv('./data/ex2.csv', dtype='object')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   height  5 non-null      object
 2   weight  5 non-null      object
 3   sex     5 non-null      object
 4   stay    5 non-null      object
dtypes: object(5)
memory usage: 332.0+ bytes

3.60 read_csv 函数和 dtype 参数（字典）

In [68]:
dtype_dict = {'height':'int16','weight':'int8','sex':'category'}
df = pd.read_csv('./data/ex2.csv', dtype=dtype_dict)
df[['height','weight','sex']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   height  5 non-null      int16
 1   weight  5 non-null      int8
 2   sex     5 non-null      category
dtypes: category(1), int16(1), int8(1)
memory usage: 168.0 bytes

3.61 使用 read_csv 函数读取 bool 类型值

In [69]:
df = pd.read_csv('./data/ex2.csv')
df['stay'].apply(type)

0    <class 'str'>
1    <class 'str'>
2    <class 'str'>
3    <class 'str'>
4    <class 'str'>
Name: stay, dtype: object

In [70]:
df = pd.read_csv('./data/ex2.csv', nrows=2)
df['stay'].apply(type)

0    <class 'bool'>
1    <class 'bool'>
Name: stay, dtype: object

3.62 read_csv 函数、true_values 参数和 false_values 参数

In [71]:
df = pd.read_csv(
    './data/ex2.csv',
    true_values=['Yes'],
    false_values=['No']
)

df['stay'].apply(type)

0    <class 'bool'>
1    <class 'bool'>
2    <class 'bool'>
3    <class 'bool'>
4    <class 'bool'>
Name: stay, dtype: object

3.63 使用 read_csv 函数读取时间序列的数据

In [72]:
df = pd.read_csv('./data/ex3.csv')
df

      date   time    city  sales
0  2019-01  19:00   Tokyo    100
1  2019-02  20:00   Tokyo    120
2  2019-03  21:00   Osaka     90
3  2019-04  22:00  Nagoya     85
4  2019-05  23:00   Osaka    115

In [73]:
df['date'].apply(type)

0    <class 'str'>
1    <class 'str'>
2    <class 'str'>
3    <class 'str'>
4    <class 'str'>
Name: date, dtype: object

3.64 read_csv 函数和 parse_dates 参数

In [74]:
df = pd.read_csv('./data/ex3.csv', parse_dates=['date'])
df['date']

0   2019-01-01
1   2019-02-01
2   2019-03-01
3   2019-04-01
4   2019-05-01
Name: date, dtype: datetime64[ns]

3.65 : read_csv函数和parse_dates参数（多个列的连接）

In [75]:
df = pd.read_csv('./data/ex3.csv', parse_dates=[['date','time']])
df

C:\Users\liye\AppData\Local\Temp\ipykernel_7776\2930120486.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.read_csv('./data/ex3.csv', parse_dates=[['date','time']])

            date_time    city  sales
0 2019-01-01 19:00:00   Tokyo    100
1 2019-02-01 20:00:00   Tokyo    120
2 2019-03-01 21:00:00   Osaka     90
3 2019-04-01 22:00:00  Nagoya     85
4 2019-05-01 23:00:00   Osaka    115

In [76]:
df['date_time']

0   2019-01-01 19:00:00
1   2019-02-01 20:00:00
2   2019-03-01 21:00:00
3   2019-04-01 22:00:00
4   2019-05-01 23:00:00
Name: date_time, dtype: datetime64[ns]

3.66 read_csv 函数会作为缺失数据识别的字符串一览表（默认值）

In [77]:
['-1.#IND', '1.#QNAN', '1.#IND', '-1.#QNAN',
 '#N/A N/A', '#N/A', 'N/A', 'n/a', 'NA','#NA',
 'NULL', 'null', 'NaN', '-NaN', 'nan', '-nan', '']

['-1.#IND',
 '1.#QNAN',
 '1.#IND',
 '-1.#QNAN',
 '#N/A N/A',
 '#N/A',
 'N/A',
 'n/a',
 'NA',
 '#NA',
 'NULL',
 'null',
 'NaN',
 '-NaN',
 'nan',
 '-nan',
 '']

3.67 read_csv 函数和缺失数据（默认值）

In [78]:
df = pd.read_csv('./data/ex4.csv')
df

  name  math  eng
0    a  82.0    ?
1    b   NaN   76
2    c  76.0   91
3    d   NaN  NaN
4    e  89.0   81
5    f   NaN  NaN

3.68 使用 isna 方法找出缺失数据

In [79]:
df.isna()

    name   math    eng
0  False  False  False
1  False   True  False
2  False  False  False
3  False   True   True
4  False  False  False
5  False   True   True

3.69 read_csv 函数和 na_values 参数

In [80]:
pd.read_csv('./data/ex4.csv', na_values=['None','?'])

  name  math   eng
0    a  82.0   NaN
1    b   NaN  76.0
2    c  76.0  91.0
3    d   NaN   NaN
4    e  89.0  81.0
5    f   NaN   NaN

3.70 read_csv 函数的 ParserError 错误

In [81]:
# pd.read_csv('./data/ex5.csv')

3.71 相对列标签，少了列数的位置

In [82]:
pd.read_csv('./data/ex5.csv', skiprows=[2])

     a    b    c    d
0   10    5   12  NaN
1  red  red  red  red

3.72 read_csv 函数和 usecols 参数

In [83]:
pd.read_csv('./data/ex5.csv', usecols=['a','b','c','d'])

     a    b    c    d
0   10    5   12  NaN
1    2    4    6    7
2  red  red  red  red

3.73 read_csv 函数的 error_bad_lines 参数和 warn_bad_lines 参数

In [84]:
# 没有这个参数
# pd.read_csv('./data/ex5.csv',
#             error_bad_lines=False,
#             warn_bad_lines=True)

3.74 使用 Python 的 open 函数浏览 CSV 文件

In [85]:
with open('./data/ex6.csv', encoding='UTF-8') as file:
    print(file.read())

a,b,c,d
1,2,3,4,
5,6,7,8,

3.75 读取行的末尾存在分隔符的文件

In [86]:
pd.read_csv('./data/ex6.csv')

   a  b  c   d
1  2  3  4 NaN
5  6  7  8 NaN

3.76 read_csv 函数和 index_col 参数

In [87]:
pd.read_csv('./data/ex6.csv', index_col=False)

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

3.77 read_csv 函数和 mangle_dupe_cols 参数

In [88]:
# 当前版本没有这个参数
# pd.read_csv('./data/ex7.csv', mangle_dupe_cols=True)

3.78 使用 open 函数浏览 CSV 文件

In [89]:
with open('./data/ex8.csv', encoding='GBK') as file:
    print(file.read())

name,height
a,161
#到此为止，为女性,
b,172
,
c,181
#到此为止，为男性,

3.79 读取包含注释行和空白行的 CSV 文件

In [90]:
pd.read_csv('./data/ex8.csv', skip_blank_lines=False,encoding='GBK')

        name  height
0          a   161.0
1  #到此为止，为女性     NaN
2          b   172.0
3        NaN     NaN
4          c   181.0
5  #到此为止，为男性     NaN

3.80 read_csv 函数的 comment 参数和 skip_blank_lines 参数

In [91]:
pd.read_csv('./data/ex8.csv', comment='#', skip_blank_lines=True,encoding='GBK')

  name  height
0    a   161.0
1    b   172.0
2  NaN     NaN
3    c   181.0

3.81 使用 open 函数浏览 CSV 文件

In [92]:
with open('./data/ex9.csv', encoding='UTF-8') as file:
    print(file.read())

Location|sales
Tokyo|1200000
Osaka|900000
Sapporo|100000

3.82 read_csv 函数和 sep 参数

In [93]:
pd.read_csv('./data/ex9.csv', sep='|')

  Location    sales
0    Tokyo  1200000
1    Osaka   900000
2  Sapporo   100000

3.83 read_csv 函数和 sep 参数（正则表达式）

In [94]:
pd.read_csv('./data/ex10.csv', sep='\t')

  Location    sales
0    Tokyo  1200000
1    Osaka   900000
2  Sapporo   100000

3.84 使用 read_table 函数读取 CSV 文件

In [95]:
pd.read_table('./data/ex10.csv')

  Location    sales
0    Tokyo  1200000
1    Osaka   900000
2  Sapporo   100000

3.85 读取包含 3 位一隔数字的数据

In [96]:
df = pd.read_csv('./data/ex11.csv', sep='\t')
df

  Location      sales
0    Tokyo  1,200,000
1    Osaka    900,000
2  Sapporo    100,000

In [97]:
df['sales'].apply(type)

0    <class 'str'>
1    <class 'str'>
2    <class 'str'>
Name: sales, dtype: object

3.86 read_csv 函数和 thousands 参数

In [98]:
df = pd.read_csv('./data/ex11.csv', sep='\t', thousands=',')
df['sales'].apply(type)

0    <class 'int'>
1    <class 'int'>
2    <class 'int'>
Name: sales, dtype: object

3.87 DataFrame 对象的 to_csv 方法

In [99]:
df = pd.DataFrame([[1,2,3],[4,5,6]], columns=list('abc'))
df

   a  b  c
0  1  2  3
1  4  5  6

In [100]:
df.to_csv('out1.csv')

3.88 DataFrame 对象的 read_csv 函数

In [101]:
pd.read_csv('out1.csv')

   Unnamed: 0  a  b  c
0           0  1  2  3
1           1  4  5  6

3.89 to_csv 方法和 index 参数

In [102]:
df.to_csv('out1.csv', index=False)
pd.read_csv('out1.csv')

   a  b  c
0  1  2  3
1  4  5  6

3.90 to_csv 方法和 header 参数

In [103]:
df.to_csv('out2.csv', header=False, index=False)

with open('out2.csv', encoding='UTF-8') as file:
    print(file.read())

1,2,3
4,5,6

3.91 to_csv 方法和 sep 参数

In [104]:
print(df.to_csv(index=False, sep='\t'))
print(df.to_csv(index=False, sep='|'))

a	b	c
1	2	3
4	5	6

a|b|c
1|2|3
4|5|6

3.92 to_csv 方法和 columns 参数

In [105]:
print(df.to_csv(index=False, columns=['a','c']))

a,c
1,3
4,6

3.93 to_csv 方法和 index_label 参数

In [106]:
df.index = ['d', 'e']
df

   a  b  c
d  1  2  3
e  4  5  6

In [107]:
df.to_csv('out3.csv', index=True, index_label='index_labels')
pd.read_csv('out3.csv')

  index_labels  a  b  c
0            d  1  2  3
1            e  4  5  6

### 3.2.2 Excel

3.94 read_excel 函数

In [108]:
pd.read_excel('./data/ex12.xlsx')

C:\devtools\python\python311\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

  employee_name  age sex         division
0             a   22  男性        logistics
1             b   31  女性        marketing
2             c   29  女性  human resources
3             d   18  男性            sales
4             e   27  女性        logistics

3.95 read_excel 函数和 sheet_name 参数

In [109]:
employees = pd.read_excel('./data/ex12.xlsx', sheet_name='employees')
employees

C:\devtools\python\python311\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

  employee_name  age sex         division
0             a   22  男性        logistics
1             b   31  女性        marketing
2             c   29  女性  human resources
3             d   18  男性            sales
4             e   27  女性        logistics

In [110]:
div = pd.read_excel('./data/ex12.xlsx', sheet_name='div')
div

C:\devtools\python\python311\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

          division location
0            sales       2F
1  human resources       2F
2        marketing       3F
3        logistics       1F

3.96 read_excel 函数和 usecols 参数

In [111]:
pd.read_excel('./data/ex12.xlsx', sheet_name='employees', usecols=[0,2])

C:\devtools\python\python311\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

  employee_name sex
0             a  男性
1             b  女性
2             c  女性
3             d  男性
4             e  女性

3.97 DataFrame 对象的 to_excel 方法

In [112]:
df = pd.DataFrame([[1,2,3],[4,5,6]], columns=list('abc'))
df

   a  b  c
0  1  2  3
1  4  5  6

In [113]:
df.to_excel('out4.xlsx', sheet_name='out4_sheet1')

3.98 read_excel 函数

In [114]:
pd.read_excel('out4.xlsx')

   Unnamed: 0  a  b  c
0           0  1  2  3
1           1  4  5  6

3.99 ExcelFile 类的实例

In [115]:
excel = pd.ExcelFile('./data/ex12.xlsx')
excel

3.100 ExcelFile 类的 sheet_names 属性

In [116]:
excel.sheet_names

['employees', 'div']

3.101 ExcelFile 类和 with 语句

In [117]:
with pd.ExcelFile('./data/ex12.xlsx') as excel:
    employees = pd.read_excel(excel, 'employees')
    div = pd.read_excel(excel, 'div')
    combined = employees.merge(div, on='division')
    
combined

C:\devtools\python\python311\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)
C:\devtools\python\python311\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

  employee_name  age sex         division location
0             a   22  男性        logistics       1F
1             e   27  女性        logistics       1F
2             b   31  女性        marketing       3F
3             c   29  女性  human resources       2F
4             d   18  男性            sales       2F

### 3.2.3 JSON

3.102 DataFrame 对象的创建

In [118]:
val = [['male',22],['female',19]]
df = pd.DataFrame(val, index=['a','b'],columns=['sex','age'])
df

      sex  age
a    male   22
b  female   19

3.103 DataFrame 对象的 to_json 方法

In [119]:
df.to_json(orient='columns')

'{"sex":{"a":"male","b":"female"},"age":{"a":22,"b":19}}'

3.104 to_json 方法和 orient 参数（table）

In [120]:
df.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"sex","type":"string"},{"name":"age","type":"integer"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"a","sex":"male","age":22},{"index":"b","sex":"female","age":19}]}'

3.105 Series 类的 to_json 方法

In [121]:
df['age'].to_json(orient='index')

'{"a":22,"b":19}'

3.106 使用 to_json 方法保存 JSON 文件

In [122]:
df.to_json('out5.json', orient='columns')

In [123]:
with open('out5.json', encoding='UTF-8') as file:
    print(file.read())

{"sex":{"a":"male","b":"female"},"age":{"a":22,"b":19}}

3.107 添加日期类型

In [124]:
df['bdate'] = pd.Timestamp('20190101')
df

      sex  age      bdate
a    male   22 2019-01-01
b  female   19 2019-01-01

3.108 to_json 方法和 date_format 参数

In [125]:
df.to_json(orient='columns', date_format='epoch')

'{"sex":{"a":"male","b":"female"},"age":{"a":22,"b":19},"bdate":{"a":1546,"b":1546}}'

In [126]:
df.to_json(orient='columns', date_format='iso')

'{"sex":{"a":"male","b":"female"},"age":{"a":22,"b":19},"bdate":{"a":"2019-01-01T00:00:00.000","b":"2019-01-01T00:00:00.000"}}'

3.109 使用 to_json 方法查看缺失数据的处理

In [127]:
df2 = df.copy()
df2.loc['a','sex'] = None
df2.loc['b','age'] = np.nan
df2.loc['a','bdate'] = np.nan
df2

      sex   age      bdate
a    None  22.0        NaT
b  female   NaN 2019-01-01

In [128]:
df2.to_json(orient='columns')

'{"sex":{"a":null,"b":"female"},"age":{"a":22.0,"b":null},"bdate":{"a":null,"b":1546}}'

3.110 使用 read_json 函数（默认）将 JSON 文件转换成 DataFrame对象

In [129]:
with open('out5.json', encoding='UTF-8') as file:
    print(file.read())

{"sex":{"a":"male","b":"female"},"age":{"a":22,"b":19}}

In [130]:
pd.read_json('out5.json', typ='frame')

      sex  age
a    male   22
b  female   19

3.111 使用 read_json 函数的 orient 参数（index）将 JSON 文件转换成 DataFrame 对象

In [131]:
pd.read_json('out5.json', typ='frame', orient='index')

        a       b
sex  male  female
age    22      19

3.112 使用 read_json 函数的 orient 参数（index）将 JSON 文件转换成 Series 对象

In [132]:
pd.read_json('./data/ex13.json', typ='series', orient='index')

a    22
b    31
c    19
dtype: int64

3.113 read_json 函数和 dtype 参数

In [133]:
df = pd.read_json('out5.json', dtype=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     2 non-null      object
 1   age     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 48.0+ bytes

In [134]:
df = pd.read_json('out5.json', dtype={'age':np.int8})
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     2 non-null      object
 1   age     2 non-null      int8
dtypes: int8(1), object(1)
memory usage: 34.0+ bytes

### 3.2.4 HDF5

3.114 DataFrame 对象的创建

In [135]:
df = pd.DataFrame([['啊',1],['咦',2]],columns=list('ab'))
df

   a  b
0  啊  1
1  咦  2

3.115 HDFStore 对象的实例

In [136]:
hdf = pd.HDFStore('./data/out7.hdf5')
hdf

<class 'pandas.io.pytables.HDFStore'>
File path: ./data/out7.hdf5

3.116 HDFStore 对象与 put 方法

In [137]:
hdf.put(key='add_df', value=df)

3.117 HDFStore 对象和方括号（[ ]）

In [138]:
ser = pd.Series([1,3,5,7],index=list('abcd'))
hdf['add_ser'] = ser

3.118 DataFrame 对象的 to_hdf 方法

In [139]:
df2 = pd.DataFrame([[0.1,2,3],[0.5,4,5]], columns=list('abc'))
df2.to_hdf('out7.hdf5', key='add_df2')

3.119 HDFStore 对象的 get 方法

In [140]:
hdf.get(key='add_df')

   a  b
0  啊  1
1  咦  2

3.120 read_hdf 函数

In [141]:
pd.read_hdf('./data/ex14.hdf5', key='out8')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

3.121 read_hdf 函数的 start 参数和 stop 参数

In [142]:
pd.read_hdf('./data/ex14.hdf5', key='out8', start=1, stop=3)

   a  b   c   d
1  4  5   6   7
2  8  9  10  11

3.122 HDFStore 对象的 get 方法和方括号（[ ]）

In [143]:
# hdf = pd.HDFStore('./data/ex14.hdf5', format='table')
#         if "format" in kwargs:
#            raise ValueError("format is not a defined argument for HDFStore")
hdf = pd.HDFStore('./data/ex14.hdf5')
hdf.get('out8')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [144]:
hdf['out8']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

3.123 to_hdf 方法和 format 参数

In [145]:
df = pd.DataFrame([[0.9,6,7]], columns=list('abc'))
df.to_hdf('out9.hdf5', key='add_df', format='table')

In [146]:
pd.read_hdf('out9.hdf5', key='add_df')

     a  b  c
0  0.9  6  7

3.124 to_hdf 方法和 append 参数

In [147]:
df2 = pd.DataFrame([[1.3,8,8]], columns=list('abc'))
df2.to_hdf('out9.hdf5', key='add_df', format='table', append=True)

In [148]:
pd.read_hdf('out9.hdf5', key='add_df')

     a  b  c
0  0.9  6  7
0  1.3  8  8

3.125 to_hdf 方法和 dropna 参数

In [149]:
df3 = pd.DataFrame([[1,2],[3,4]], columns=list('ab'))
df3.loc[0,:] = np.nan
df3.to_hdf('out9.hdf5', key='add_df3', format='table', dropna=True)
df3

     a    b
0  NaN  NaN
1  3.0  4.0

In [150]:
pd.read_hdf('out9.hdf5', key='add_df3')

     a    b
1  3.0  4.0

3.126 read_hdf 方法和 columns 参数

In [151]:
pd.read_hdf('out9.hdf5', key='add_df', columns=['a','c'])

     a  c
0  0.9  7
0  1.3  8

3.127 HDFStore 对象的 select 方法和 columns 参数

In [152]:
hdf = pd.HDFStore('out9.hdf5')
hdf.select(key='add_df', columns=['a','c'])

     a  c
0  0.9  7
0  1.3  8